app/views/home/user_data.html.erb

SELECT  "alumnos".* FROM "alumnos" WHERE "alumnos"."user_id" = $1 LIMIT 1  [["user_id", 662]]
---
  <% if @usuario %>
    <% if @usuario.alumno.blank?  %>