app/controllers/home_controller.rb

SELECT  "alumnos".* FROM "alumnos" WHERE "alumnos"."user_id" = $1 LIMIT 1  [["user_id", 227]]
SELECT  "ciclos".* FROM "ciclos" WHERE (actual = TRUE)  ORDER BY "ciclos"."id" ASC LIMIT 1
SELECT "inscripciones".* FROM "inscripciones" WHERE "inscripciones"."alumno_id" = $1  [["alumno_id", 2547]]
---
  def index
    @usuario = current_user
    @periodo_actual = current_ciclo.ciclo
    @inscripciones = @usuario.alumno.inscripciones.select{|item| item.ciclo_id == current_ciclo.id}

SELECT "inscripciones".* FROM "inscripciones" WHERE "inscripciones"."alumno_id" = $1  [["alumno_id", 2547]]
---
  def show_inscripciones
     @usuario = current_user
     @inscripciones = @usuario.alumno.inscripciones
     @inscripciones_agrupadas = @inscripciones.group_by { |inscripcion| inscripcion.semestr.clave_semestre  }

SELECT  "alumnos".* FROM "alumnos" WHERE "alumnos"."user_id" = $1 LIMIT 1  [["user_id", 662]]
SELECT  "ciclos".* FROM "ciclos" WHERE (actual = TRUE)  ORDER BY "ciclos"."id" ASC LIMIT 1
SELECT "inscripciones".* FROM "inscripciones" WHERE "inscripciones"."alumno_id" = $1  [["alumno_id", 2547]]
---
  def user_data
    @usuario = current_user
    @periodo_actual = current_ciclo.ciclo
    ciclo = Ciclo.get_ciclo_at_fecha(Date.today) || current_ciclo
    @inscripciones = @usuario.alumno.inscripciones.select{|item| item.ciclo_id == ciclo.id} if ciclo.present?