app/controllers/user_sessions_controller.rb

  def create
    @user_session = UserSession.new(params[:user_session])


    if @user_session.save
      current_user_session_role = (UserSession.find).user.role_id
      if [1,2,3].include? current_user_session_role
        flash[:error] = " Nombre de Usuario y/o Contraseña inválidos. Inténtelo nuevamente"
        redirect_to :action => :destroy
      else
        current_user_session_id = (UserSession.find).user.id
        @alumno = Alumno.where("user_id = ?",current_user_session_id).first
---
SELECT "users".* FROM "users" WHERE (LOWER("users".login) = 'default_admin') LIMIT 1
SELECT  "alumnos".* FROM "alumnos" WHERE (user_id = 662)  ORDER BY "alumnos"."id" ASC LIMIT 1